$$.module.address.source.hotel_hotData = {
     "热门": "@|北京@|上海@|广州@|深圳@|成都@|杭州|武汉|西安",
    'ABC': "@|安庆@|安顺@|安阳@|鞍山@|阿拉善盟@|安康@|阿坝@|阿里@|阿克苏",
    'DEF':"@|定西@|东莞@|定安县@|东方@|儋州@|大庆@|大兴安岭@|大连@|丹东@|德州@|东营",
	'GHJ':"@|定西@|东莞@|定安县@|东方@|儋州@|大庆@|大兴安岭@|大连@|丹东@|德州@|东营",
	'KLM':"@|安庆@|安顺@|安阳@|鞍山@|阿拉善盟@|安康@|阿坝@|阿里@|阿克苏",
	'NPQ':"@|北京@|上海@|广州@|深圳@|成都@|杭州|武汉|西安",
	'RST':"@|安庆@|安顺@|安阳@|鞍山@|阿拉善盟@|安康@|阿坝@|阿里@|阿克苏",
	'WXY':"@|定西@|东莞@|定安县@|东方@|儋州@|大庆@|大兴安岭@|大连@|丹东@|德州@|东营",
	'Z':"@|安庆@|安顺@|安阳@|鞍山@|阿拉善盟@|安康@|阿坝@|阿里@|阿克苏"
};


String.prototype.cntStr = function() {
    return this.replace(/@+/g, "@");
};
